Repository: xshaheen/cs-framework
Catalog: src/Framework.FluentValidation/Resources/FluentValidatorErrors.*.resx
Languages: ar

# phone_number:local_number
source: The entered phone number don't have all the information to be dialled from anywhere inside or outside the country. Please enter the phone number in a global format.
ar: رقم الهاتف الذي تم إدخاله لا يحتوي على جميع المعلومات المطلوب للاتصال به من أي مكان داخل الدولة أو خارجها. الرجاء إدخال رقم الهاتف بالتنسيق الدولي.

# phone_number:invalid_country_code
source: The number has an invalid country calling code.
ar: الرقم له رمز اتصال غير صالح للبلد.

# phone_number:invalid_number
source: "{PropertyValue}" is not a valid phone number.
ar: "{PropertyValue}" ليس رقم هاتف صالحًا.

# collection:minimum_elements
source: {PropertyName} must contain at least {MinElements} items. The {PropertyName} contains {TotalElements} element.
ar: يجب أن يحتوي {PropertyName} على {MinElements} من العناصر على الأقل. يحتوي {PropertyName} على {TotalElements}.

# collection:maximum_elements
source: {PropertyName} must contain fewer than {MaxElements} items. The {PropertyName} contains {TotalElements} element.
ar: يجب ان تحتوي {PropertyName} علي عناصر اقل من {MaxElements}. {PropertyName} تحتوي علي {TotalElements}.

# collection:unique_elements
source: {PropertyName} must contain unique items. The {PropertyName} contains {TotalDuplicates} duplicates.
ar: يجب أن يحتوي {PropertyName} على عناصر غير مكررة. يحتوي {PropertyName} على {TotalDuplicates} من التكرارات.

# national_id:invalid_egyptian_national_id
source: The entered national id is invalid.
ar: الرقم القومي الذي تم إدخاله غير صالح.

# url:invalid
source: The URL is invalid.
ar: عنوان URL غير صالح.

# geo:invalid_latitude
source: Invalid latitude value. It must be between -90 and 90.
ar: قيمة خط العرض غير صالحة. يجب أن يكون بين -90 و 90.

# geo:invalid_longitude
source: Invalid longitude value. It must be between -180 and 180.
ar: قيمة خط الطول غير صالحة. يجب أن يكون بين 180 و 180.
