Repository: xshaheen/cs-framework
Catalog: src/Framework.Payments.Paymob.Services/Resources/CashInMessages.*.resx
Languages: ar

# CashNoEtisalatCash
source: The operation could not be completed. This phone number is not subscribe to Etisalat Cash service to subscribe please visit the nearest branch of Etisalat with the SM card and national number.
ar: لا يمكن إتمام العملية. هذا الرقم غير مشترك في خدمة اتصالات كاش للاشتراك برجاء زيارة أقرب فرع من فروع اتصالات بالخط والرقم القومي.

# CashNoVodafoneCash
source: The operation could not be completed. This phone number is not subscribe to Etisalat Cash service to subscribe please visit the nearest branch of Etisalat with the SM card and national number.
ar: لا يمكن إتمام العملية. هذا الرقم غير مشترك في خدمة فودافون كاش للاشتراك برجاء زيارة أقرب فرع من فروع فودافون بالخط والرقم القومي.

# CashProviderConnectionFailed
source: Failed to start payment with the provider. Please try again later.
ar: فشل في البدء في الدفع مع المزود. الرجاء معاودة المحاولة في وقت لاحق.

# CashInvalidEtisalatNumber
source: Not valid Etisalat phone number. Please enter a valid 11 digit number start with 011.
ar: ليس رقم موبايل اتصالات صالح. الرجاء إدخال رقم صحيح مكون من 11 رقما يبدأ بـ 011.

# CashInvalidOrangeNumber
source: Not valid Orange phone number. Please enter a valid 11 digit number start with 012.
ar: ليس رقم موبايل اورانج صالح. الرجاء إدخال رقم صحيح مكون من 11 رقما يبدأ بـ 012.

# CashInvalidVodafoneNumber
source: Not valid Vodafone phone number. Please enter a valid 11 digit number start with 010.
ar: ليس رقم موبايل فودافون صالح. الرجاء إدخال رقم صحيح مكون من 11 رقما يبدأ بـ 011.

# CashNotValidWalletPhoneNumber
source: Not a valid number. Please enter a portfolio number for an 11-digit Egyptian number starting at 010, 011, 012 or 015.
ar: ليس رقم صالح. الرجاء إدخال رقم محفظة لرقم مصري صحيح مكون من 11 رقما يبدأ بـ 010 او 011 او 012 او 015.

# CashInProviderConnectionFailed
source: Failed to connect to payment provider.
ar: فشل الاتصال بشركة الدفع.

# CashOutInsufficientFunds
source: Insufficient funds.
ar: رصيد غير كاف.

# CashOutInvalidRequest
source: Invalid data. Please make sure you enter a valid data.
ar: البيانات غير صالحة. يرجى التأكد من إدخال بيانات صالحة.

# CashOutProviderIsDown
source: Payment provider server is down. Please try again later.
ar: خادم مزود الدفع غير متاح حاليا. الرجاء معاودة المحاولة في وقت لاحق.
